app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "description" = ?, "title" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["description", "\nTony Stark builds an armored suit to fight the throes of evil"], ["title", "Updated Movie Title"], ["updated_at", "2015-09-25 00:33:25.637465"]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)